// /data/dataKey-dashboard.ts
// 統計ダッシュボード
export const dataKeyDashboard = {
  "年齢別人口": { // 円グラフ（単年のみ）、積み上げ棒グラフ、グループ化棒グラフ、レーダーチャート（単年のみ）
    IndicatorCodes: "0201010010000010010,0201010010000010020,0201010010000010030",
    IndicatorLabels: "0～14歳,15～64歳,65歳以上",
  },
  "昼間人口": {
    IndicatorCodes: "0201010000000010000,0201060000000010000",
    IndicatorLabels: "総人口,昼間人口"
  },
  "通学・通勤スタイル": { // レーダーチャート
    IndicatorCodes: "0201050001000010020,0201050002000010010,0201050002000010020,0201050003000010010,0201050003000010020",
    IndicatorLabels: "自市区町村内,県内にて,他県にて,県内から,他県から"
  },
  "世帯の種類": { //円グラフ
    IndicatorCodes: "0202010101000010020,0202010101000010030,0202010103000010020,0202010102000010010",
    IndicatorLabels: "核家族世帯,核家族以外の世帯,単独世帯,その他", // 「非親族を含む世帯」は「その他」にしました
  },
  "65歳以上の人のいる核家族世帯": { // 円グラフ
    IndicatorCodes: "0202010101000010020,0202010201000010020",
    IndicatorLabels: "核家族世帯数,65歳以上の世帯員のいる核家族世帯数",
  // 65歳以上の世帯員のいる核家族世帯数⇒家族と同居（核家族）／65歳以上の世帯員のいる親族のみの世帯数⇒家族と同居（核家族以外も含む）／65歳以上の親族のいるその他の親族世帯数⇒親戚と同居／夫65歳以上、妻60歳以上の夫婦のみの世帯数⇒高齢夫婦のみ／65歳以上の世帯員のいる単独世帯数⇒一人暮らし
  // 上記のものを描かせようと思いましたが、「家族と同居（核家族）」しかありませんでした
  },
  "就業者数（国勢調査）": { // グラフ
    IndicatorCodes: "0301100000010010010,0301100000010010020,0301100000010010030,0301100000010010040",
    IndicatorLabels: "主に仕事,家事のほか仕事,通学のかたわら仕事,休業者"
  },
  "職業分類": { // グラフ
    IndicatorCodes: "0301103200010010010,0301103200010010020,0301103200010010030,0301103200010010040,0301103200010010050,0301103200010010060,0301103200010010070,0301103200010010080,0301103200010010090,0301103200010010100,0301103200010010110,0301103200010010120",
    IndicatorLabels: "管理的職業,専門的・技術的職業,事務,販売,サービス,保安,農林漁業,生産工程,輸送・機械運転,建設・採掘,運搬・清掃・包装等,その他"
    // 「分類不能の職業従事者数」は「その他」にしました
    // これは県しかなかった！
  },
  "産業別就業者数": { // 円グラフ、積み上げ棒グラフ
    IndicatorCodes: "0301108000010110000,0301108000010210000,0301108000010310000",
    IndicatorLabels: "第1次産業,第2次産業,第3次産業"
  },
  "店舗数": {
    IndicatorCodes: "0601100100000010010,0601100100000010020,0601100100000010030",
    IndicatorLabels: "飲食店,大型小売店,百貨店・総合スーパー数",

  },
  "店舗割合": {
    IndicatorCodes: "0601100100000110010,0601100100000210020,0601100100000210030",
    IndicatorLabels: "飲食店[/千人],大型小売店[/10万人],百貨店・総合スーパー数[/10万人]",

  },
  "住宅の所有数": {
    IndicatorCodes: "0801010102010010000,0801010102020010000",
    IndicatorLabels: "持ち家,借家",

  },
  "住宅の建て方": {
    IndicatorCodes: "0801010103010010010,0801010103020010010,0801010103030010010",
    IndicatorLabels: "戸建住宅,テラスハウス・長屋等,アパート・マンション等",
    comment1: "「長屋建住宅」を「テラスハウス・長屋等」、「共同住宅」を「アパート・マンション等」としました。"
  },
  "住宅の構造": {
    IndicatorCodes: "0801010104010010010,0801010104010010020,0801010104010010030,0801010104020010010,0801010104020010030,0801010104020010040,0801010104030010010",
    IndicatorLabels: "木造,木造（防火木造を除く）,防火木造,非木造,鉄筋・鉄骨コンクリート造,鉄骨造,その他",

  },
  "住宅の建築時期": {
    IndicatorCodes: "0801010105000010012,0801010105000010070,0801010105000010080,0801010105000010110,0801010105000010150,0801010105000010170,0801010105000010190,0801010105000010200",
    IndicatorLabels: "1970年以前,1971～1980年,1981～1990年,1991～2000年,2001～2005年,2006～2010年,2011～2015年,2016～2018年9月",

  },
  "居住室の畳数別住宅数": {
    IndicatorCodes: "0801010106000010010,0801010106000010020,0801010106000010030,0801010106000010040,0801010106000010050,0801010106000010060,0801010106000010070,0801010106000010080",
    IndicatorLabels: "5.9畳以下,6.0～11.9畳,12.0～17.9畳,18.0～23.9畳,24.0～29.9畳,30.0～35.9畳,36.0～47.9畳,48.0畳以上",

  },
  "1住宅当たり延べ面積": {
    IndicatorCodes: "0801010401000010000",
    IndicatorLabels: "1住宅当たり延べ面積",

  },
  "最寄りの保育所までの距離の住宅数（普通世帯）": {
    IndicatorCodes: "0801020103010110010,0801020103010110020,0801020103010110030,0801020103010110040,0801020103010110050",
    IndicatorLabels: "100m未満,100～200m未満,200～500m未満,500m～1km未満,1km以上",

  },
  "教育施設数[/可住地面積100k㎡]": {
    IndicatorCodes: "1201010300000110000,1201010400000110000,1201010500000110000",
    IndicatorLabels: "小学校数,中学校,高等学校",
  },
  "教育施設数": {
    IndicatorCodes: "1201010100000010000,1201010200000010000,1201010300000010000,1201010400000010000,1201010500000010000,1201010600000010000,1201010800000010000",
    IndicatorLabels: "幼稚園,認定こども園,小学校,中学校,高等学校,中等教育学校,大学・大学院",
  // 一応入れておきますが、高等学校、大学・大学院のデータは自治体にはありません
  },
  "在学者1人当たり学校教育費": {
    IndicatorCodes: "1201400102000010010,1201400103000010010,1201400104000010010,1201400105000010010",
    IndicatorLabels: "幼保連携型認定こども園,小学校,中学校,高等学校・全日制",
  // 自治体データなし。県のみ
  },
  "通勤・通学の平均時間": {
    IndicatorCodes: "1203150101000010000,1203150102000010000,1203150101000110010,1203150102000110010,1203150101010010010,1203150102010010010",
    IndicatorLabels: "10歳以上（男）,10歳以上（女）,15歳以上（男）,15歳以上（女）,有業者（男）,有業者（女）",
    // 自治体データなし。県のみ
  },
  "仕事の平均時間": {
    IndicatorCodes: "1203150201000010000,1203150202000010000,1203150201000110010,1203150202000110010,1203150201010010010,1203150202010010010,1203150201020010010,1203150202020010010",
    IndicatorLabels: "10歳以上（男）,10歳以上（女）,15歳以上（男）,15歳以上（女）,有業者（男）,有業者（女）,無業者（男）,無業者（女）",
  // 市区町村なし
  },
  "学業の平均時間": {
    IndicatorCodes: "1203150301000010000,1203150302000010000,1203150301000110010,1203150302000110010,1203150301010010010,1203150302010010010,1203150301020010010,1203150302020010010",
    IndicatorLabels: "10歳以上（男）,10歳以上（女）,15歳以上（男）,15歳以上（女）,有業者（男）,有業者（女）,無業者（男）,無業者（女）",
    // 市区町村なし
  },
  "家事の平均時間": {
    IndicatorCodes: "1203150401000010000,1203150401000110010,1203150401010010010,1203150401020010010,1203150402000010000,1203150402000110010,1203150402010010010,1203150402020010010",
    IndicatorLabels: "10歳以上（男）,15歳以上（男）,有業者（男）,無業者（男）,10歳以上（女）,15歳以上（女）,有業者（女）,無業者（女）",
    // 市区町村なし
  },
  "通勤・通学手段別人数": {
    IndicatorCodes: "1203180101000010020,1203180101000010030,1203180101000010040,1203180101000010050,1203180101000010060,1203180101000010090,1203180101000010100,1203180101000010110,1203180101000010120,1203180101000010130,1203180101000010140",
    IndicatorLabels: "徒歩だけ,鉄道・電車,乗合バス,勤め先・学校のバス,自家用車,利用交通手段が2種類,利用交通手段が3種類以上,オートバイ,自転車,ハイヤー・タクシー,その他",

  },
  "自市区町村内通勤・通学手段別人数": {
    IndicatorCodes: "1203180201000010090,1203180201000010100,1203180201000010110,1203180201000010120,1203180201000010130,1203180201000010140",
    IndicatorLabels: "利用交通手段が2種類,利用交通手段が3種類以上,オートバイ,自転車,ハイヤー・タクシー,その他",
    // 市区町村なし
  },
  "県内他市区町村への通勤・通学手段別人数": {
    IndicatorCodes: "1203180301000010020,1203180301000010030,1203180301000010040,1203180301000010050,1203180301000010060,1203180301000010090,1203180301000010100,1203180301000010110,1203180301000010120,1203180301000010130,1203180301000010140",
    IndicatorLabels: "徒歩だけ,鉄道・電車,乗合バス,勤め先・学校のバス,自家用車,利用交通手段が2種類,利用交通手段が3種類以上,オートバイ,自転車,ハイヤー・タクシー,その他",
    // 市区町村なし
  },
  "他県への通勤・通学手段別人数": {
    IndicatorCodes: "1203180401000010030,1203180401000010040,1203180401000010050,1203180401000010090,1203180401000010100,1203180401000010110,1203180401000010120,1203180401000010130,1203180401000010140",
    IndicatorLabels: "鉄道・電車,乗合バス,勤め先・学校のバス,利用交通手段が２種類,利用交通手段が３種類以上,オートバイ,自転車,ハイヤー・タクシー,その他",
    // 市区町村なし
  },
  "通勤・通学者の数": {
    IndicatorCodes: "1203180201000010010,1203180301000010010,1203180401000010010",
    IndicatorLabels: "自市区町村内,県内他市区町村へ,他県へ",

  }
} as const;

export type DashboardDataKey = keyof typeof dataKeyDashboard;
